posts/2021-05-27-asio-note.org
#+title: asio note
#+date: <2021-05-26 14:06>
#+filetags: c++
#+begin_comment
;;; asio_note.org --- boost asio learning notes

;;; Commentary:
;;  It's a personal note.
;;  Written by (c) ZHONG Ming.  2020-2021.
#+end_comment
#+OPTIONS: ^:nil

* asio 简介
** tutorial
asio 是一个跨平台的 c++ 网络库, 现在的最新版本为1.18.2, 在 Windows 下调用 IOCP, Linux 下调用 epoll, BSD 下调用 kqueue

introduction:
[[http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2012/n3388.pdf][Using Asio with C++11]]

asio 库的官方示例文档:
[[https://think-async.com/Asio/asio-1.18.2/doc/asio/tutorial.html][asio tutorial]]

作者的 github:
[[https://github.com/chriskohlhoff/asio/tree/cpp11-only][chriskohlhoff asio]]

- install asio
  #+begin_src sh
    # for mac
    brew install asio
    # for ubuntu
    apt install libasio-dev
  #+end_src
** timer
- asio::deadline_timer :: 使用的计量时间是系统时间 (posix_time), 因此修改系统时间会影响 deadline_timer 的行为
- asio::steady_timer :: 基于 std::chrono::steady_clock 是一个不会受系统时间影响的定时器

** boost::asio 和 asio
asio 可以独立于 boost 库, 大部分新的编译器(vs 2012, gcc 4.7 -std=c11 后) 会自动添加 *ASIO_STANDALONE*, 表示 asio 不需要用到 boost 库
#+begin_quote
 most of Asio may now be used without a dependency on Boost header files or libraries.

Boost.Asio 1.18.2 is also included in Boost 1.76.
#+end_quote

* 异步 asio 使用
** async echo server with callback
下面为一个简单的使用异步 asio 的 echo 服务器

首先创建一个 CRTP 类 Session
- CRTP 奇异递归模板模式, 更一般地被称作 F-bound polymorphism
- 派生类继承自模板类, 派生类将自身作为参数传给模板类
- 基类转换成派生类用的是 static_cast 而不是 dynamic_cast, 降低了继承带来的虚函数表查询开销
- enable_shared_from_this 和 ranges::view_interface 属于 CRTP
#+begin_src c++
  // CRTP
  class Session : public std::enable_shared_from_this<Session>
  {
  public:
    Session(asio::ip::tcp::socket socket)
      : socket_(std::move(socket)) {}

    void start()
    {
      do_read();
    }
  
  private:
    void do_read()
    {
      auto self(shared_from_this());
      socket_.async_read_some(asio::buffer(data_, maxLen),
                              [this, self]
                              (std::error_code ec, size_t len)
                              {
                                if (!ec)
                                  // this->do_write(len)
                                  do_write(len);
                              });
    }

    void do_write(size_t len)
    {
      auto self(shared_from_this());
      asio::async_write(socket_, asio::buffer(data_, len),
                        [this, self](std::error_code ec, size_t)
                        {
                          if (!ec)
                            do_read();
                        });
    }
  
    asio::ip::tcp::socket socket_;
    enum { maxLen = 1024 };
    char data_[maxLen];
  };
#+end_src
- 这里使用 callback handler 函数的方式实现异步, 使用了 *async_read_some* 和 *async_write* 对 socket 进行读写
  #+begin_src c++
  async_read_some(asio::error_code, std::size_t)>::return_type
    async_read_some(const MutableBufferSequence &buffers,
    const ReadHandler &handler)


  async_write(asio::error_code, std::size_t)>::return_type
    async_write(AsyncWriteStream &s, DynamicBuffer_v2 buffers,
    CompletionCondition completion_condition,
    const WriteHandler &handler,
    typename enable_if<is_dynamic_buffer_v2<DynamicBuffer_v2>
    ::value>::type * = 0)

  #+end_src
- socket 的传递需要使用 std::move()

接下来创建 Server 类:
#+begin_src c++
class Server
{
public:
  Server(asio::io_context &io_context, short port)
    : acceptor_(io_context,
		asio::ip::tcp::endpoint(asio::ip::tcp::v4(), port))
  {
    do_accept();
  }

private:
  void do_accept()
  {
    acceptor_.async_accept([this](std::error_code ec,
				  asio::ip::tcp::socket socket)
    {
      if (!ec)
	std::make_shared<Session>(std::move(socket))->start();
      do_accept();
    });
  }

  asio::ip::tcp::acceptor acceptor_;
};
#+end_src
- socket 的传递始终使用 std::move()
- 这里使用 make_shared<T>() 创建 Session, 使用 make_shared 和 shared_ptr+new 的优劣 trade-offs 如下:
  + std::shared_ptr<T>(new T(args...)) 调用两次 allocations (one for the object T and one for the control block of the shared pointer), 而 std::make_shared<T> 只调用一次 allocation
  + 如果有 std::weak_ptr 引用由 std::make_shared 创建的控制块, 当所有 shared 结束生命周期后, 内存要等到所有 weak 销毁后才释放
  + std::make_shared 需要构造函数为 public
  + std::make_shared 使用的是 ::new, 修改 operator new 会导致行为和 std::shared_ptr<T>(new T(args...)) 不同
- 使用 *async_accept* 接收新的连接
  #+begin_src c++
 async_accept(asio::error_code)>::return_type
   async_accept(basic_socket<protocol_type, Executor1> &peer,
   endpoint_type &peer_endpoint, const AcceptHandler &handler)

  #+end_src

最后是 asio::io_context 的执行:
#+begin_src c++
#include <stdio.h>
#include <memory>
#include <utility>
#include "asio.hpp"

int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context;
      // listen to localhost:9999
      Server server(io_context, 9999);
      io_context.run();
    }
  catch (std::exception &e)
    {
      printf("exception %s\n", e.what());
    }
  return 0;
}
#+end_src
