2021-05-27-asio-note.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://zhongming-unice.github.io/rss.xml"
      title="RSS feed for https://zhongming-unice.github.io/">
<title>asio note</title>
<meta name="author" content="ming"><meta name="referrer" content="no-referrer"><link href="static/usual-org-front-matter.css" rel="stylesheet" type="text/css" /><link href="static/org-notes-style.css" rel="stylesheet" type="text/css" /><link href="static/floating-toc.css" rel="stylesheet" type="text/css" /><link href="static/blog-banner.css" rel="stylesheet" type="text/css" /><link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status"><div class="header">  <div class="sitelinks">    <a href="https://zhongming-unice.github.io/about.html">about</a>    | <a href="https://zhongming-unice.github.io/archive.html">archive</a>    | <a href="https://zhongming-unice.github.io/rss.xml">rss</a>  </div></div></div>
<div id="content">
<div class="post-date">26  5 2021</div><h1 class="post-title"><a href="https://zhongming-unice.github.io/2021-05-27-asio-note.html">asio note</a></h1>
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org70f2cef">1. asio 简介</a>
<ul>
<li><a href="#org1b0e11c">1.1. tutorial</a></li>
<li><a href="#org89a70d1">1.2. timer</a></li>
<li><a href="#orgadef70f">1.3. boost::asio 和 asio</a></li>
</ul>
</li>
<li><a href="#orgf8a099c">2. 异步 asio 使用</a>
<ul>
<li><a href="#org955f133">2.1. async echo server with callback</a></li>
<li><a href="#org31d8cbc">2.2. multi-threaded</a></li>
<li><a href="#org962642e">2.3. 使用 future 代替 callback</a></li>
<li><a href="#org56329d5">2.4. 使用 coroutine 代替 callback</a></li>
</ul>
</li>
<li><a href="#orgcbab820">3. misc</a>
<ul>
<li><a href="#org84edecb">3.1. composed asynchronous operation</a></li>
<li><a href="#org9d106ab">3.2. asio 更新</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org70f2cef" class="outline-2">
<h2 id="org70f2cef"><span class="section-number-2">1</span> asio 简介</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1b0e11c" class="outline-3">
<h3 id="org1b0e11c"><span class="section-number-3">1.1</span> tutorial</h3>
<div class="outline-text-3" id="text-1-1">
<p>
asio 是一个跨平台的 c++ 网络库, 现在的最新版本为1.18.2, 在 Windows 下调用 IOCP, Linux 下调用 epoll, BSD 下调用 kqueue
</p>

<p>
introduction:
<a href="http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2012/n3388.pdf">Using Asio with C++11</a>
</p>

<p>
asio 库的官方示例文档:
<a href="https://think-async.com/Asio/asio-1.18.2/doc/asio/tutorial.html">asio tutorial</a>
</p>

<p>
作者的 github:
<a href="https://github.com/chriskohlhoff/asio/tree/cpp11-only">chriskohlhoff asio</a>
</p>

<ul class="org-ul">
<li><p>
install asio
</p>
<div class="org-src-container">
<pre class="src src-sh"># for mac
brew install asio
# for ubuntu
apt install libasio-dev
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org89a70d1" class="outline-3">
<h3 id="org89a70d1"><span class="section-number-3">1.2</span> timer</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt>asio::deadline_timer</dt><dd>使用的计量时间是系统时间 (posix_time), 因此修改系统时间会影响 deadline_timer 的行为</dd>
<dt>asio::steady_timer</dt><dd>基于 std::chrono::steady_clock 是一个不会受系统时间影响的定时器</dd>
</dl>
</div>
</div>

<div id="outline-container-orgadef70f" class="outline-3">
<h3 id="orgadef70f"><span class="section-number-3">1.3</span> boost::asio 和 asio</h3>
<div class="outline-text-3" id="text-1-3">
<p>
asio 可以独立于 boost 库, 大部分新的编译器(vs 2012, gcc 4.7 -std=c11 后) 会自动添加 <b>ASIO_STANDALONE</b>, 表示 asio 不需要用到 boost 库
</p>
<blockquote>
<p>
most of Asio may now be used without a dependency on Boost header files or libraries.
</p>

<p>
Boost.Asio 1.18.2 is also included in Boost 1.76.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orgf8a099c" class="outline-2">
<h2 id="orgf8a099c"><span class="section-number-2">2</span> 异步 asio 使用</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org955f133" class="outline-3">
<h3 id="org955f133"><span class="section-number-3">2.1</span> async echo server with callback</h3>
<div class="outline-text-3" id="text-2-1">
<p>
下面为一个简单的使用异步 asio 的 echo 服务器
</p>

<p>
首先创建一个 CRTP 类 Session
</p>
<ul class="org-ul">
<li>CRTP 奇异递归模板模式, 更一般地被称作 F-bound polymorphism</li>
<li>派生类继承自模板类, 派生类将自身作为参数传给模板类</li>
<li>基类转换成派生类用的是 static_cast 而不是 dynamic_cast, 降低了继承带来的虚函数表查询开销</li>
<li>enable_shared_from_this 和 ranges::view_interface 属于 CRTP</li>
</ul>
<div class="org-src-container">
<pre class="src src-c++">// CRTP
class Session : public std::enable_shared_from_this&lt;Session&gt;
{
public:
  Session(asio::ip::tcp::socket socket)
    : socket_(std::move(socket)) {}

  void start()
  {
    do_read();
  }

private:
  void do_read()
  {
    auto self(shared_from_this());
    socket_.async_read_some(asio::buffer(data_, maxLen),
			    [this, self]
			    (std::error_code ec, size_t len)
			    {
			      if (!ec)
				// this-&gt;do_write(len)
				do_write(len);
			    });
  }

  void do_write(size_t len)
  {
    auto self(shared_from_this());
    asio::async_write(socket_, asio::buffer(data_, len),
		      [this, self](std::error_code ec, size_t)
		      {
			if (!ec)
			  do_read();
		      });
  }

  asio::ip::tcp::socket socket_;
  enum { maxLen = 1024 };
  char data_[maxLen];
};
</pre>
</div>
<ul class="org-ul">
<li><p>
这里使用 callback handler 函数的方式实现异步, 使用了 <b>async_read_some</b> 和 <b>async_write</b> 对 socket 进行读写
</p>
<div class="org-src-container">
<pre class="src src-c++">async_read_some(asio::error_code, std::size_t)&gt;::return_type
  async_read_some(const MutableBufferSequence &amp;buffers,
  const ReadHandler &amp;handler)


async_write(asio::error_code, std::size_t)&gt;::return_type
  async_write(AsyncWriteStream &amp;s, DynamicBuffer_v2 buffers,
  CompletionCondition completion_condition,
  const WriteHandler &amp;handler,
  typename enable_if&lt;is_dynamic_buffer_v2&lt;DynamicBuffer_v2&gt;
  ::value&gt;::type * = 0)

</pre>
</div></li>
<li>socket 的传递需要使用 std::move()</li>
</ul>

<p>
接下来创建 Server 类:
</p>
<div class="org-src-container">
<pre class="src src-c++">class Server
{
public:
  Server(asio::io_context &amp;io_context, short port)
    : acceptor_(io_context,
		asio::ip::tcp::endpoint(asio::ip::tcp::v4(), port))
  {
    do_accept();
  }

private:
  void do_accept()
  {
    acceptor_.async_accept([this](std::error_code ec,
				  asio::ip::tcp::socket socket)
    {
      if (!ec)
	std::make_shared&lt;Session&gt;(std::move(socket))-&gt;start();
      do_accept();
    });
  }

  asio::ip::tcp::acceptor acceptor_;
};
</pre>
</div>
<ul class="org-ul">
<li>socket 的传递始终使用 std::move()</li>
<li>这里使用 make_shared&lt;T&gt;() 创建 Session, 使用 make_shared 和 shared_ptr+new 的优劣 trade-offs 如下:
<ul class="org-ul">
<li>std::shared_ptr&lt;T&gt;(new T(args&#x2026;)) 调用两次 allocations (one for the object T and one for the control block of the shared pointer), 而 std::make_shared&lt;T&gt; 只调用一次 allocation</li>
<li>如果有 std::weak_ptr 引用由 std::make_shared 创建的控制块, 当所有 shared 结束生命周期后, 内存要等到所有 weak 销毁后才释放</li>
<li>std::make_shared 需要构造函数为 public</li>
<li>std::make_shared 使用的是 ::new, 修改 operator new 会导致行为和 std::shared_ptr&lt;T&gt;(new T(args&#x2026;)) 不同</li>
</ul></li>
<li><p>
使用 <b>async_accept</b> 接收新的连接
</p>
<div class="org-src-container">
<pre class="src src-c++">async_accept(asio::error_code)&gt;::return_type
  async_accept(basic_socket&lt;protocol_type, Executor1&gt; &amp;peer,
  endpoint_type &amp;peer_endpoint, const AcceptHandler &amp;handler)

</pre>
</div></li>
</ul>

<p>
最后是 asio::io_context 的执行:
</p>
<div class="org-src-container">
<pre class="src src-c++">#include &lt;stdio.h&gt;
#include &lt;memory&gt;
#include &lt;utility&gt;
#include "asio.hpp"

int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context;
      // listen to localhost:9999
      Server server(io_context, 9999);
      io_context.run();
    }
  catch (std::exception &amp;e)
    {
      printf("exception %s\n", e.what());
    }
  return 0;
}
</pre>
</div>
</div>
</div>
