posts/2021-05-27-asio-note.org
** multi-threaded
上面的例子是单进程单线程的, 如希望使用多个线程来处理同一个 io_context 需要加上 asio::strand 解决竞态问题
- strand 用于串行化回调函数的执行
- asio::strand 基于 mutex 实现, 保证 callback 的顺序, 使用 strand.post/wrap 包装非线程安全的操作, wrap 最近已经弃用, 使用 asio::bind_executor 代替

下面是根据 strand 改进的 echo server:
#+begin_src c++
#include <stdio.h>
#include <memory>
#include <vector>
#include <thread>
#include <utility>
#include "asio.hpp"

// CRTP
class Session : public std::enable_shared_from_this<Session>
{
public:
  Session(asio::io_context &io_context)
    : socket_(io_context), strand_(io_context) {}

  void start()
  {
    do_read();
  }

  asio::ip::tcp::socket &socket() { return socket_; }
  
private:
  void do_read()
  {
    auto self(shared_from_this());
    socket_.async_read_some(asio::buffer(data_, maxLen),
			    asio::bind_executor(strand_,
						[this, self]
			    (std::error_code ec, size_t len)
			    {
			      if (!ec)
				do_write(len);
			    }));
  }

  void do_write(size_t len)
  {
    auto self(shared_from_this());
    asio::async_write(socket_, asio::buffer(data_, len),
		      asio::bind_executor(strand_,
		       [this, self](std::error_code ec, size_t)
		      {
			if (!ec)
			  do_read();
		      }));
  }

  asio::io_context::strand strand_;
  asio::ip::tcp::socket socket_;
  enum { maxLen = 1024 };
  char data_[maxLen];
};

class Server
{
public:
  Server(asio::io_context &io_context, short port)
    : acceptor_(io_context,
		asio::ip::tcp::endpoint(asio::ip::tcp::v4(), port)),
      io_context_(io_context)
  {
    do_accept();
  }

private:
  void do_accept()
  {
    auto session = std::make_shared<Session>(io_context_);
    acceptor_.async_accept(session->socket(),
			   [this, session](std::error_code ec)
			   {
			     if (!ec)
			       session->start();
			     do_accept();
			   });
  }

  asio::io_context &io_context_;
  asio::ip::tcp::acceptor acceptor_;
};

int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context;
      Server server(io_context, 9999);
      auto thread_num = std::thread::hardware_concurrency();
      printf("thread number is: %d\n", thread_num);
      std::vector<std::thread> thread_pool;
      for (int i = 0; i < thread_num; ++i)
	{
	  thread_pool.emplace_back([&io_context](){ io_context.run(); });
	}

      for (auto &t : thread_pool)
	t.join();
    }
  catch (std::exception &e)
    {
      printf("exception %s\n", e.what());
    }
  return 0;
}

#+end_src
- 使用 asio::bind_executor(strand, handler) 包装回调函数
- std::thread::hardware_concurrency() 可以获取支持的并发线程数
** 使用 future 代替 callback
我们可以使用 c++ 的新特性 std::future 来代替异步调用中的 callback

下面我简单实现了一个 async echo server with std::future:

先看 echo 函数:
#+begin_src c++
std::future<void> echo(asio::ip::tcp::socket socket)
{
  try
    {
      char data[1024];
      while (1)
	{
	  std::future<size_t> f_read = 
	    socket.async_read_some(asio::buffer(data),
				   asio::use_future);
	  auto len = f_read.get();
	  asio::async_write(socket, asio::buffer(data, len),
			    asio::use_future);
	}
    }
  catch (std::exception &e)
    {
      printf("echo exception: %s\n", e.what());
    }
}
#+end_src
这里使用 asio::use_future 来代替 handler

接下来是监听函数:
#+begin_src c++
std::future<void> listener(asio::io_context &io_context)
{
  asio::ip::tcp::acceptor acceptor(io_context,
				   {asio::ip::tcp::v4(), 9999});
  while (1)
    {
      std::future<asio::ip::tcp::socket> f_socket =
	acceptor.async_accept(asio::use_future);

      auto socket = f_socket.get();
      std::future<void> f_echo
	= std::async(std::launch::async,
		     [&]{ return echo(std::move(socket)).get(); });
      f_echo.get();
    }
}
#+end_src
最后是 main 函数
#+begin_src c++
#include <stdio.h>
#include <future>
#include <asio.hpp>

int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context(1);
      asio::signal_set signals(io_context, SIGINT, SIGTERM);
      signals.async_wait([&](auto, auto)
      {
	// signal handler
	io_context.stop();
      });
      std::future<void> f
	= std::async(std::launch::async,
		     [&]{ return listener(io_context).get(); });
      io_context.run();
      f.get();
    }
  catch (std::exception &e)
    {
      printf("exception: %s\n", e.what());  
    }

  return 0;
}
#+end_src

- TODO: 好像有点 bug 待处理
** 使用 coroutine 代替 callback
同样, 我们可以使用 asio 中的协程来代替 callback,
下面是一个简单的使用 asio 协程的 echo 服务器:

先看 echo 函数:
#+begin_src c++
asio::awaitable<void> echo(asio::ip::tcp::socket socket)
{
  try
    {
      char data[1024];
      while (1)
	{
	  size_t n = co_await
	    socket.async_read_some(asio::buffer(data),
				   asio::use_awaitable);
	  co_await async_write(socket, asio::buffer(data, n),
			       asio::use_awaitable);
	}
    }
  catch (std::exception &e)
    {
      printf("echo exception: %s\n", e.what());  
    }
}
#+end_src
上面函数中用到的关键字:
- asio::awaitable :: 可等待体
  #+begin_src c++
  template<
    typename T,
    typename Executor = executor>
  class awaitable
  #+end_src
- co_await :: 一元运算符 co_await 暂停协程并将控制返回给调用方
- asio::use_awaitable :: 表示当前正在执行的协程的 completion token

然后是监听:
#+begin_src c++
asio::awaitable<void> listener()
{
  auto executor = co_await asio::this_coro::executor;
  asio::ip::tcp::acceptor acceptor(executor,
				   {asio::ip::tcp::v4(), 9999});
  while (1)
    {
      asio::ip::tcp::socket socket = co_await
	acceptor.async_accept(asio::use_awaitable);
      
      asio::co_spawn(executor, echo(std::move(socket)),
		     asio::detached);
    }
}
#+end_src
- spawn 函数是用于 stackful 的协程的高级包装器, spawn 函数使程序能够以同步方式实现异步逻辑
- co_spawn 用于 spawn 一个新的 coroutined-based thread
- 第一个参数是 executor 决定了执行协程的上下文
- 第四个参数 completion token, 用于产生 completion handler 在 coroutine 结束时调用, 我们这里使用了 asio::detached, 表示显式忽略异步操作的结果
  #+begin_src c++
  template<
    typename Executor,
    typename T,
    typename AwaitableExecutor,
    typename CompletionToken = DEFAULT>
  DEDUCED co_spawn
  #+end_src

main 函数使用 co_spawn 产生新的协程:
#+begin_src c++
int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context(1);
      asio::signal_set signals(io_context, SIGINT, SIGTERM);
      signals.async_wait([&](auto, auto)
      {
        // signal handler
	    io_context.stop();
      });
      asio::co_spawn(io_context, listener(), asio::detached);
      io_context.run();
    }
  catch (std::exception &e)
    {
      printf("exception: %s\n", e.what());  
    }

  return 0;
}
#+end_src

* misc
