2021-05-27-asio-note.html
<div id="outline-container-org31d8cbc" class="outline-3">
<h3 id="org31d8cbc"><span class="section-number-3">2.2</span> multi-threaded</h3>
<div class="outline-text-3" id="text-2-2">
<p>
上面的例子是单进程单线程的, 如希望使用多个线程来处理同一个 io_context 需要加上 asio::strand 解决竞态问题
</p>
<ul class="org-ul">
<li>strand 用于串行化回调函数的执行</li>
<li>asio::strand 基于 mutex 实现, 保证 callback 的顺序, 使用 strand.post/wrap 包装非线程安全的操作, wrap 最近已经弃用, 使用 asio::bind_executor 代替</li>
</ul>

<p>
下面是根据 strand 改进的 echo server:
</p>
<div class="org-src-container">
<pre class="src src-c++">#include &lt;stdio.h&gt;
#include &lt;memory&gt;
#include &lt;vector&gt;
#include &lt;thread&gt;
#include &lt;utility&gt;
#include "asio.hpp"

// CRTP
class Session : public std::enable_shared_from_this&lt;Session&gt;
{
public:
  Session(asio::io_context &amp;io_context)
    : socket_(io_context), strand_(io_context) {}

  void start()
  {
    do_read();
  }

  asio::ip::tcp::socket &amp;socket() { return socket_; }

private:
  void do_read()
  {
    auto self(shared_from_this());
    socket_.async_read_some(asio::buffer(data_, maxLen),
			    asio::bind_executor(strand_,
						[this, self]
			    (std::error_code ec, size_t len)
			    {
			      if (!ec)
				do_write(len);
			    }));
  }

  void do_write(size_t len)
  {
    auto self(shared_from_this());
    asio::async_write(socket_, asio::buffer(data_, len),
		      asio::bind_executor(strand_,
		       [this, self](std::error_code ec, size_t)
		      {
			if (!ec)
			  do_read();
		      }));
  }

  asio::io_context::strand strand_;
  asio::ip::tcp::socket socket_;
  enum { maxLen = 1024 };
  char data_[maxLen];
};

class Server
{
public:
  Server(asio::io_context &amp;io_context, short port)
    : acceptor_(io_context,
		asio::ip::tcp::endpoint(asio::ip::tcp::v4(), port)),
      io_context_(io_context)
  {
    do_accept();
  }

private:
  void do_accept()
  {
    auto session = std::make_shared&lt;Session&gt;(io_context_);
    acceptor_.async_accept(session-&gt;socket(),
			   [this, session](std::error_code ec)
			   {
			     if (!ec)
			       session-&gt;start();
			     do_accept();
			   });
  }

  asio::io_context &amp;io_context_;
  asio::ip::tcp::acceptor acceptor_;
};

int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context;
      Server server(io_context, 9999);
      auto thread_num = std::thread::hardware_concurrency();
      printf("thread number is: %d\n", thread_num);
      std::vector&lt;std::thread&gt; thread_pool;
      for (int i = 0; i &lt; thread_num; ++i)
	{
	  thread_pool.emplace_back([&amp;io_context](){ io_context.run(); });
	}

      for (auto &amp;t : thread_pool)
	t.join();
    }
  catch (std::exception &amp;e)
    {
      printf("exception %s\n", e.what());
    }
  return 0;
}

</pre>
</div>
<ul class="org-ul">
<li>使用 asio::bind_executor(strand, handler) 包装回调函数</li>
<li>std::thread::hardware_concurrency() 可以获取支持的并发线程数</li>
</ul>
</div>
</div>
<div id="outline-container-org962642e" class="outline-3">
<h3 id="org962642e"><span class="section-number-3">2.3</span> 使用 future 代替 callback</h3>
<div class="outline-text-3" id="text-2-3">
<p>
我们可以使用 c++ 的新特性 std::future 来代替异步调用中的 callback
</p>

<p>
下面我简单实现了一个 async echo server with std::future:
</p>

<p>
先看 echo 函数:
</p>
<div class="org-src-container">
<pre class="src src-c++">std::future&lt;void&gt; echo(asio::ip::tcp::socket socket)
{
  try
    {
      char data[1024];
      while (1)
	{
	  std::future&lt;size_t&gt; f_read = 
	    socket.async_read_some(asio::buffer(data),
				   asio::use_future);
	  auto len = f_read.get();
	  asio::async_write(socket, asio::buffer(data, len),
			    asio::use_future);
	}
    }
  catch (std::exception &amp;e)
    {
      printf("echo exception: %s\n", e.what());
    }
}
</pre>
</div>
<p>
这里使用 asio::use_future 来代替 handler
</p>

<p>
接下来是监听函数:
</p>
<div class="org-src-container">
<pre class="src src-c++">std::future&lt;void&gt; listener(asio::io_context &amp;io_context)
{
  asio::ip::tcp::acceptor acceptor(io_context,
				   {asio::ip::tcp::v4(), 9999});
  while (1)
    {
      std::future&lt;asio::ip::tcp::socket&gt; f_socket =
	acceptor.async_accept(asio::use_future);

      auto socket = f_socket.get();
      std::future&lt;void&gt; f_echo
	= std::async(std::launch::async,
		     [&amp;]{ return echo(std::move(socket)).get(); });
      f_echo.get();
    }
}
</pre>
</div>
<p>
最后是 main 函数
</p>
<div class="org-src-container">
<pre class="src src-c++">#include &lt;stdio.h&gt;
#include &lt;future&gt;
#include &lt;asio.hpp&gt;

int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context(1);
      asio::signal_set signals(io_context, SIGINT, SIGTERM);
      signals.async_wait([&amp;](auto, auto)
      {
	// signal handler
	io_context.stop();
      });
      std::future&lt;void&gt; f
	= std::async(std::launch::async,
		     [&amp;]{ return listener(io_context).get(); });
      io_context.run();
      f.get();
    }
  catch (std::exception &amp;e)
    {
      printf("exception: %s\n", e.what());  
    }

  return 0;
}
</pre>
</div>

<ul class="org-ul">
<li>TODO: 好像有点 bug 待处理</li>
</ul>
</div>
</div>
<div id="outline-container-org56329d5" class="outline-3">
<h3 id="org56329d5"><span class="section-number-3">2.4</span> 使用 coroutine 代替 callback</h3>
<div class="outline-text-3" id="text-2-4">
<p>
同样, 我们可以使用 asio 中的协程来代替 callback,
下面是一个简单的使用 asio 协程的 echo 服务器:
</p>

<p>
先看 echo 函数:
</p>
<div class="org-src-container">
<pre class="src src-c++">asio::awaitable&lt;void&gt; echo(asio::ip::tcp::socket socket)
{
  try
    {
      char data[1024];
      while (1)
	{
	  size_t n = co_await
	    socket.async_read_some(asio::buffer(data),
				   asio::use_awaitable);
	  co_await async_write(socket, asio::buffer(data, n),
			       asio::use_awaitable);
	}
    }
  catch (std::exception &amp;e)
    {
      printf("echo exception: %s\n", e.what());  
    }
}
</pre>
</div>
<p>
上面函数中用到的关键字:
</p>
<dl class="org-dl">
<dt>asio::awaitable</dt><dd><p>
可等待体
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;
  typename T,
  typename Executor = executor&gt;
class awaitable
</pre>
</div></dd>
<dt>co_await</dt><dd>一元运算符 co_await 暂停协程并将控制返回给调用方</dd>
<dt>asio::use_awaitable</dt><dd>表示当前正在执行的协程的 completion token</dd>
</dl>

<p>
然后是监听:
</p>
<div class="org-src-container">
<pre class="src src-c++">asio::awaitable&lt;void&gt; listener()
{
  auto executor = co_await asio::this_coro::executor;
  asio::ip::tcp::acceptor acceptor(executor,
				   {asio::ip::tcp::v4(), 9999});
  while (1)
    {
      asio::ip::tcp::socket socket = co_await
	acceptor.async_accept(asio::use_awaitable);

      asio::co_spawn(executor, echo(std::move(socket)),
		     asio::detached);
    }
}
</pre>
</div>
<ul class="org-ul">
<li>spawn 函数是用于 stackful 的协程的高级包装器, spawn 函数使程序能够以同步方式实现异步逻辑</li>
<li>co_spawn 用于 spawn 一个新的 coroutined-based thread</li>
<li>第一个参数是 executor 决定了执行协程的上下文</li>
<li><p>
第四个参数 completion token, 用于产生 completion handler 在 coroutine 结束时调用, 我们这里使用了 asio::detached, 表示显式忽略异步操作的结果
</p>
<div class="org-src-container">
<pre class="src src-c++">template&lt;
  typename Executor,
  typename T,
  typename AwaitableExecutor,
  typename CompletionToken = DEFAULT&gt;
DEDUCED co_spawn
</pre>
</div></li>
</ul>

<p>
main 函数使用 co_spawn 产生新的协程:
</p>
<div class="org-src-container">
<pre class="src src-c++">int main(int argc, char *argv[])
{
  try
    {
      asio::io_context io_context(1);
      asio::signal_set signals(io_context, SIGINT, SIGTERM);
      signals.async_wait([&amp;](auto, auto)
      {
	// signal handler
	    io_context.stop();
      });
      asio::co_spawn(io_context, listener(), asio::detached);
      io_context.run();
    }
  catch (std::exception &amp;e)
    {
      printf("exception: %s\n", e.what());  
    }

  return 0;
}
</pre>
</div>
</div>
</div>
</div>
