posts/2021-05-27-asio-note.org
** composed asynchronous operation
我们可以 *async_write* 函数包装一下成一个新的函数:
#+begin_src c++
template <typename CompletionToken>
auto async_write_message(tcp::socket& socket,
    const char* message, CompletionToken&& token)
{
  return asio::async_write(socket,
      asio::buffer(message, std::strlen(message)),
      std::forward<CompletionToken>(token));
}
#+end_src
这里的返回值会根据 token 的类型进行自动类型推导:
- 当 completion token 是简单的 callback, 返回值为 void
- 当 completion token 是 asio::use_future, 返回值为 std::future<std::size_t>
- 当 completion token 是 asio::yield_context (用于 stackful coroutines), 返回值为 std::size_t

这里使用完美转发 std::forwar<>() 自动判断左值右值, 进行 copy 或 move

- 使用 callback ::
  #+begin_src c++
  async_write_message(socket, "callback\r\n",
      [](const std::error_code &error, std::size_t n)
      {
        if (!error)
          printf("%d bytes transferred\n", n);
        else
          printf("error: %s\n", error.message().c_str());
      });
  #+end_src

- 使用 future ::
  #+begin_src c++
  std::future<std::size_t> f = async_write_message(
      socket, "future\r\n", asio::use_future);

  io_context.run();

  try
  {
    std::size_t n = f.get();
    printf("%d bytes transferred\n", n);
  }
  catch (const std::exception& e)
  {
    printf("error: %s\n", e.what());
  }

  #+end_src

** asio 更新
- boost 1.66 中, *io_service* 已经改名为 *io_context*
  #+begin_quote
  io_service -> io_context
  io_service.post() -> io_context.get_executor().post()
  io_service.post() -> post(io_context, handler))
  io_service.dispatch() -> io_context.get_executor().dispatch()
  io_service::strand -> strand<io_context::executor_type>
  ...
  #+end_quote

- lambda 代替 bind 将成员函数注册为回调函数
  #+begin_src c++
class tcp_connection
{
  void handle_write(const boost::system::error_code &/*error*/,
		    size_t /*bytes_transferred*/) {}
  // ...
}

// bind
asio::async_write(socket_, asio::buffer(message_),
		  std::bind(&tcp_connection::handle_write,
			    shared_from_this(),
			    asio::placeholders::error,
			    asio::placeholders::bytes_transferred));

// lambda
auto self = shared_from_this();
asio::async_write(socket_, asio::buffer(message_),
		  [self = std::move(self)]
		  (auto error, auto bytes_transferred)
		  {
		    self->handle_write(error, bytes_transferred);
		  });

  #+end_src

