2021-05-27-asio-note.html

<div id="outline-container-orgcbab820" class="outline-2">
<h2 id="orgcbab820"><span class="section-number-2">3</span> misc</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org84edecb" class="outline-3">
<h3 id="org84edecb"><span class="section-number-3">3.1</span> composed asynchronous operation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
我们可以 <b>async_write</b> 函数包装一下成一个新的函数:
</p>
<div class="org-src-container">
<pre class="src src-c++">template &lt;typename CompletionToken&gt;
auto async_write_message(tcp::socket&amp; socket,
    const char* message, CompletionToken&amp;&amp; token)
{
  return asio::async_write(socket,
      asio::buffer(message, std::strlen(message)),
      std::forward&lt;CompletionToken&gt;(token));
}
</pre>
</div>
<p>
这里的返回值会根据 token 的类型进行自动类型推导:
</p>
<ul class="org-ul">
<li>当 completion token 是简单的 callback, 返回值为 void</li>
<li>当 completion token 是 asio::use_future, 返回值为 std::future&lt;std::size_t&gt;</li>
<li>当 completion token 是 asio::yield_context (用于 stackful coroutines), 返回值为 std::size_t</li>
</ul>

<p>
这里使用完美转发 std::forwar&lt;&gt;() 自动判断左值右值, 进行 copy 或 move
</p>

<dl class="org-dl">
<dt>使用 callback</dt><dd><div class="org-src-container">
<pre class="src src-c++">async_write_message(socket, "callback\r\n",
    [](const std::error_code &amp;error, std::size_t n)
    {
      if (!error)
	printf("%d bytes transferred\n", n);
      else
	printf("error: %s\n", error.message().c_str());
    });
</pre>
</div></dd>

<dt>使用 future</dt><dd><div class="org-src-container">
<pre class="src src-c++">std::future&lt;std::size_t&gt; f = async_write_message(
    socket, "future\r\n", asio::use_future);

io_context.run();

try
{
  std::size_t n = f.get();
  printf("%d bytes transferred\n", n);
}
catch (const std::exception&amp; e)
{
  printf("error: %s\n", e.what());
}

</pre>
</div></dd>
</dl>
</div>
</div>

<div id="outline-container-org9d106ab" class="outline-3">
<h3 id="org9d106ab"><span class="section-number-3">3.2</span> asio 更新</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><p>
boost 1.66 中, <b>io_service</b> 已经改名为 <b>io_context</b>
</p>
<blockquote>
<p>
io_service -&gt; io_context
</p>

<p>
io_service.post() -&gt; io_context.get_executor().post()
</p>

<p>
io_service.post() -&gt; post(io_context, handler))
</p>

<p>
io_service.dispatch() -&gt; io_context.get_executor().dispatch()
</p>

<p>
io_service::strand -&gt; strand&lt;io_context::executor_type&gt;
</p>

<p>
&#x2026;
</p>
</blockquote></li>

<li><p>
lambda 代替 bind 将成员函数注册为回调函数
</p>
<div class="org-src-container">
<pre class="src src-c++">class tcp_connection
{
  void handle_write(const boost::system::error_code &amp;/*error*/,
		    size_t /*bytes_transferred*/) {}
  // ...
}

// bind
asio::async_write(socket_, asio::buffer(message_),
		  std::bind(&amp;tcp_connection::handle_write,
			    shared_from_this(),
			    asio::placeholders::error,
			    asio::placeholders::bytes_transferred));

// lambda
auto self = shared_from_this();
asio::async_write(socket_, asio::buffer(message_),
		  [self = std::move(self)]
		  (auto error, auto bytes_transferred)
		  {
		    self-&gt;handle_write(error, bytes_transferred);
		  });

</pre>
</div></li>
</ul>
</div>
</div>
</div>
<div class="taglist"><a href="https://zhongming-unice.github.io/tags.html">Tags</a>: <a href="https://zhongming-unice.github.io/tag-c++.html">c++</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
